type ShapeType = {
  [key: string]: string;
};

export const SHAPE: ShapeType = {
  egg: `
  🙆‍♀️ 여성
  
  #김태희 #태연 #한가인 #송지효 
  
  계란형 얼굴은 가장 이상적인 얼굴형으로 알려져 있습니다. 
  
  계란형 얼굴은 갸름한 얼굴형을 잘 보여줄 수 있는 업 스타일, 포니테일 스타일이나 컬이 들어간 레이어드 S컬 파마, 중간 길이의 머리에 가벼운 웨이브, 보브컷, 짧은 커트, 베이비펌, 셋팅펌이 잘 어울립니다. 
  
  다만 이마를 가리는 무거운 느낌의 뱅은 답답한 느낌을 줄 수 있기 때문에 피하는 게 좋습니다. 
  
  그리고 너무 긴 머리는 어울리지 않는답니다. 자칫 얼굴의 가로길이가 작아져 나이 들어 보일 수 있기 때문입니다. 
  
  - **잘 어울리는 헤어스타일** #업_스타일 #포니테일_스타일 #컬이_들어간_레이어드_S컬_파마 #중간 길이의_머리에_가벼운_웨이브 #보브컷 #짧은_커트 #베이비펌 #셋팅펌
  - **피해야 할 헤어스타일** #무거운_느낌의_뱅 #긴_머리
  
  
  🙆‍♂️ 남성
  
  #차은우 #이현우  #지드래곤
  
  달걀형 얼굴은 세로 길이가 가로 길이보다 적당하고, 어떤 헤어도 잘 어울리며 부드러운 인상을 위해 갸름한 얼굴형과 둥근 턱 선에 곡선을 더해줘야 합니다. 
  
  이마가 넓으면 가르마를 만들어주고, 좁거나 일반적이면 이마를 드러내는 스타일이 좋습니다. 
  
  - **잘 어울리는 헤어스타일** #가르마_타는_머리 #내리는_머리_스타일 #포멀한_스타일 #더해주는_곡선_스타일 
  - **피해야 할 헤어스타일** #앞머리를_내린_스타일 #컬이_많은_스타일`,
  long: `
  🙆‍♀️ 여성
  
  #하니 #최지우 #유인나 #고준희 #로제 
  
  긴 얼굴형은 이마와 턱선에서 변화가 거의 없는 좁고 세련된 형태이며, 웨이브 볼륨펌과 유연한 스타일로 얼굴을 넓게 보이도록 하는 것이 이상적이며, 숏컷이나 사이드로 머리를 몰아주는 스타일이 얼굴형에 적합합니다. 
  
  - **잘 어울리는 헤어스타일** #웨이브볼륨펌 #얼굴길이감소 #S자웨이브 #미디엄롱기장 #루즈한스타일 #시스루뱅 #사이드머리 
  - **피해야 할 헤어스타일** #스트레이트헤어 #앞머리없는스타일 #긴얼굴강조 #길어보이는스타일 #앞머리짧은뱅 #5:5가르마
  
  🙆‍♂️ 남성
  
  #김우빈 #이병헌
  
  긴 얼굴형은 앞머리를 내려서 얼굴을 작게 보이도록 하고, 가르마를 타는 머리 스타일이 좋으며, 드라이 펌이나 웨이브펌으로 볼륨감을 줘야 합니다. 
  
  구레나룻선을 너무 짧게 자르거나 다운펌으로 누르면 주의해야 합니다. 
  
  - **잘 어울리는 헤어스타일** #가르마를_타는_머리 #소프트_투_블록 #이마가_살짝_보이는_애즈_펌 #웨이브펌 #6:4가르마 
  - **피해야 할 헤어스타일** #짧은_구렛나루 #다운펌 #머리_사이드를_짧게_자른_스타일`,
  square: `
  🙆‍♀️ 여성
  
  #정유미 #김태리 #한효주

  네모형 얼굴형은 각이 진 느낌의 얼굴로, 앞머리를 턱선이나 입술선으로 내리고 S자 웨이브를 주는 스타일이 잘 어울리며, 가볍고 굵은 웨이브가 들어간 롱 헤어가 우아하고 부드러운 느낌을 줄 수 있습니다. 
  
  단발머리로 보브 헤어 스타일이 잘 어울리며 가르마는 6:4로 주는 것이 좋습니다. 5:5 가르마나 일자 앞머리는 피하는 것이 좋습니다.
  
  - **잘 어울리는 헤어스타일** #앞머리내리는스타일 #S자웨이브 #부드러운곡선 #롱헤어 #레이어드C컬 #업스타일 #미디엄레이어드 #보브헤어 #가르마6:4
  - **피해야 할 헤어스타일** #앞머리짧은스타일 #5:5가르마 #일자앞머리 #짧은단발 #각진얼굴부각 #스트레이트헤어

  🙆‍♂️ 남성
  
  #이동욱 #김종국 #전현무

  각진 얼굴형은 부드러운 펌과 가르마를 타는 정갈한 포마드 스타일로 매력을 뽐낼 수 있으며, 구레나룻이나 수염을 통해 시선을 퍼뜨려 부드러운 인상을 줄 수 있습니다. 
  
  옆머리를 길게 자라 광대뼈를 자연스럽게 드러내는 것이 좋습니다.
  
  - **잘 어울리는 헤어스타일** #부드러운_펌 #앞머리_정돈 #이마_드러내기
  - **피해야 할 헤어스타일** #옆머리_길게_자르기 #뾰족한_구레나룻 #뾰족한_수염
    `,
  round: `
  🙆‍♀️ 여성
  
  #민아 #산다라박 #소희 #김다미 

  동그란 얼굴형은 둥근 얼굴과 원형 턱선으로 발랄하고 귀여운 느낌을 줍니다. 
  
  길어 보이도록 자연스럽게 떨어지는 스타일과 이마를 드러내는 헤어스타일이 어울리며, 윗머리에 볼륨을 주면 갸름해보입니다. 
  
  단발이나 가슴 중간을 넘는 긴 기장이 얼굴형을 부각시키는데 도움이 되며, 뿌리 볼륨펌과 레이어드 C컬펌이 잘 어울립니다. 
  
  6:4 가르마가 얼굴을 갸름하게 보이게 하는데 이상적이며, 5:5 가르마는 얼굴형을 부각시키므로 피하는 것이 좋습니다.
  
  - **잘 어울리는 헤어스타일** #단발 #긴_기장 #뿌리_볼륨펌  #레이어드_C컬펌 #긴_웨이브  #하이_포니테일 #긴_앞머리_스타일  #6:4_가르마
  - **피해야 할 헤어스타일** #길게_떨어지는_스타일 #이마_드러내기 #윗머리에_볼륨
  
  🙆‍♂️ 남성
  
  #조정석 #송중기

  둥근 얼굴형은 선명한 인상을 주기 위해 일자로 옆 헤어를 눌러주고, 위에 볼륨을 주며 이마를 드러내는 스타일이 어울리며, 투블럭, 세미 크롭컷, 모히칸 스타일이 좋고, 옆머리와 뒷머리는 짧게 자르는 것이 도움이 됩니다. 
  
  펌은 윗머리에 볼륨을 주고 옆머리는 가라앉히는 것이 좋습니다. 가르마 펌이나 리젠트 펌도 추천됩니다.
  
  - **잘 어울리는 헤어스타일** #투블럭 #세미_크롭컷 #모히칸_스타일 #펌
  - **피해야 할 헤어스타일** #너무_둥근_옆머리 #어중간하게_자른_스타일`,
  heart_tri: `
  🙆‍♀️ 여성
  
  #신민아 #청하 #손담비 #제시 #사나

  하트 모양(역삼각형) 얼굴형은 이마가 넓고 턱이 뾰족하여 시크한 인상을 주지만 턱 부위를 넓게 보이도록 하는 헤어스타일이 적절하며, 귀 높이에서부터 웨이브가 들어간 스타일이 어울리고 시스루 뱅 스타일로 이마를 커버해 여성스러운 매력을 높일 수 있습니다.\n 
  어울리는 가르마는 6:4, 7:3이며 짧은 숏컷이나 얼굴 전체를 드러내는 스타일은 피하는 것이 좋습니다. 
  
  - **잘 어울리는 헤어스타일** #6:4 #7:3 #굵은_웨이브의_볼륨감 #한쪽으로_넘긴 스타일 #시스루_뱅_스타일의_앞머리 
  - **피해야 할 헤어스타일** #짧은_숏컷 #얼굴_전체를_드러내는_스타일

  🙆‍♂️ 남성
  
  #Ryan_Gosling #강다니엘 #현빈   

  하트형/역삼각형 얼굴형은 턱이 뾰족하고 광대와 이마로 넓어지는 특징으로, 부드러운 실루엣과 풍성한 볼륨을 주어 부드러운 인상을 연출하는 것이 좋으며, 윗머리와 옆머리는 가로로 늘려 시선 분산시키고, 가일 컷, 히피펌, 스핀 스왈로, 가르마 펌, 투 블록 등의 스타일을 추천합니다. 
  
  너무 짧은 헤어스타일은 피하는 것이 좋습니다.
  
  - **잘 어울리는 헤어스타일** #가일_컷 #히피펌 #스핀_스왈로 #쉐도우펌 #가르마_펌 #투_블록
  - **피해야 할 헤어스타일** #짧은_헤어스타일`,
};

export const koreanKeyMappings: ShapeType = {
  egg: "계란형",
  long: "긴 얼굴형",
  square: "네모형",
  round: "둥근 얼굴형",
  heart_tri: "하트/역삼각형 얼굴형",
};
